  # 两个正态总体参数的区间估计
# 1. 均值差\mu_1- \mu_2的置信区间
#
# Yuehan Yang. 2014/10/19 yyh@cufe.edu.cn

# 1.1 两方差已知时均值差的置信区间
# 求置信区间的函数
two.sample.ci<-function(x,y,conf.level=0.95,sigma1,sigma2 ){
  m <- length(x); n <- length(y)
  xbar<-mean(x)-mean(y) 
  alpha <- 1 - conf.level
  zstar<- qnorm(1-alpha/2)* (sigma1/m+sigma2/n)^(1/2)
  result<- xbar +c(-zstar, +zstar)
  return(result)
}

# e.g. 为比较两个小麦品种的产量, 选择18块条件相似的试验田, 
# 采用相同的耕作方法做实验, 
# 结果播种甲品种的8块实验田的单位面积产量
# 和播种乙品种的10块实验田的单位面积产量分别为:
# 甲品种 628 583 510 554 612 523 530 615
# 乙品种 535 433 398 470 567 480 498 560 503 426
# 假定每个品种的单位面积产量均服从正态分布,
# 甲品种产量的方差为2140,
# 乙品种产量的方差为3250,
# 试求这两个品种平均面积产量差的置信区间(取\alpha=0.05)
# 解

x<-c(628,583,510,554,612,523,530,615)
y<-c(535,433,398,470,567,480,498,560,503,426)
sigma1<-2140
sigma2<-3250
two.sample.ci(x,y,conf.level=0.95, sigma1,sigma2)

# 所以这两个品种平均面积产量差的
# 置信水平0.95的置信区间为(34.67, 130.08).


# 1.2 两方差未知但相等时均值差的置信区间
# 利用t.test( )求两方差都未知但相等时两均值差的置信区间

# e.g. 上例中, 如果不知道两种品种产量的方差但已知两者相等, 
# 此时须在t.test( )中指定选项var.equal=TRUE, 则有

x<-c(628,583,510,554,612,523,530,615)
y<-c(535,433,398,470,567,480,498,560,503,426)
t.test(x,y,var.equal=TRUE)

# 这两个品种的单位面积产量之差的
# 置信水平0.95的置信区间为(29.4696,135.2804).