# 两个正态总体参数的区间估计
# 2. \sigma^2_1/\sigma^2_2的置信区间
#
# Yuehan Yang. 2014/10/19 yyh@cufe.edu.cn

# var.test( )可以直接用于求两正态总体方差比的置信区间
var.test(x, y, ratio = 1,
         alternative = c("two.sided", "less", "greater"),
         conf.level = 0.95, ...)
# 在求置信区间时, 我们只需给出两个总体的样本x, y
# 以及相应的置信水平, 
# 选项alternative用于下一章的假设检验

# e.g. 甲、乙两台机床分别加工某种轴承, 轴承的直径分别服从
# 正态分布N(\mu_1,\sigma^2_1), N(\mu_2,\sigma^2_2), 
# 从各自加工的轴承中分别抽取若干个轴承测其直径, 
# 结果如下表所示. 
# 试求两台机床加工的轴承直径的方差比的0.95置信区间

# 表 机床加工的轴的直径数据总体样本容量直径
#   总体  样本容量   直径
#  X(机床甲)  8     20.5 19.8 19.7 20.4 20.1 20.0 19.0 19.9
#  Y(机床乙)  7    20.7 19.8 19.5 20.8 20.4 19.6 20.2

# 解
x<-c(20.5,19.8,19.7,20.4,20.1,20.0,19.0,19.9)
y<-c(20.7,19.8,19.5,20.8,20.4,19.6,20.2)
var.test(x,y)

# 可见两台机床的加工的轴承的直径的方差比
# 的0.95置信区间为(0.1393,4.0600 ). 
# 结果中sample estimates给出的是方差比矩估计值0.7931937.


# 样本比率的检验作为思考题留给感兴趣的同学