# t检验
# 1. 单正态总体参数的假设检验
# 1.2 方差未知时\mu的检验
#
# Yuehan Yang. 2014/10/22 yyh@cufe.edu.cn

# 采用已有函数 t.test()

# e.g.某车间用一台包装机包装精盐, 额定标准每袋净重500g, 
# 设包装机包装出的盐每袋净重X(\mu,\sigma^2), 
# 某天随机地抽取9袋, 称得净重为
490,506, 508, 502, 498, 511, 510, 515, 512
# 假设命题为该车间精盐符合标准，检验结果是?

# 本题目使用t.test()
# 给结果赋值，分析结果
# 学会使用attributes()
# 尝试使用$符号












salt<-c(490 , 506, 508, 502, 498, 511, 510, 515 , 512)
ttest<-t.test(salt, mu=500)
attributes(ttest)
ttest
ttest$p.value
# 结论: 因为p值=0.05919 > \alpha = 0.05, 
# 故不能拒绝原假设, 不能认为该包装机不正常
ttest$conf.int
# 结论：其置信水平为95%的置信区间为
# 499.7158, 511.8398









# e.g.已知某种水样中CaCO3的真值为20.7mg/L, 
# 现用某种方法重复测定该水样11次, 
# CaCO3的含量为: 
20.9, 20.41, 20.10, 20.00, 20.19, 22.60,20.99, 20.41, 20, 23, 22
# 问用该法测定的CaCO3含量的均值与真值有无显著差异? 
# (显著性水平为0.05)




CaCo3<-c(20.9, 20.41, 20.10, 20.00, 20.19,
         22.60, 20.99, 20.41, 20, 23, 22)
t.test(CaCo3, mu=20.7)

#结论: 因为p值＝0.438>0.05, 
# 故认为此法所测定的水中CaCO3的含量的
# 均值与真值无显著差异